Repository: lp-linguify/linguify
Catalog: backend/locale/*/LC_MESSAGES/django.po
Languages: es, nl

source: Linguify - Apprendre les langues avec l'IA
es: Linguify - Aprende Idiomas con IA
nl: Linguify - Leer Talen met AI

source: Linguify vous aide à apprendre les langues grâce à l'intelligence artificielle. Cours personnalisés, exercices interactifs et suivi de progression.
es: Linguify te ayuda a aprender idiomas a través de la inteligencia artificial. Cursos personalizados, ejercicios interactivos y seguimiento del progreso.
nl: Linguify helpt je talen leren door middel van kunstmatige intelligentie. Gepersonaliseerde cursussen, interactieve oefeningen en voortgangsvolging.

source: apprentissage langues, IA, intelligence artificielle, cours personnalisés, flashcards, notebook
es: aprendizaje de idiomas, IA, inteligencia artificial, cursos personalizados, flashcards, cuaderno
nl: talen leren, AI, kunstmatige intelligentie, gepersonaliseerde cursussen, flashcards, notitieboek

source: Basculer la navigation
es: Alternar navegación
nl: Navigatie wisselen

source: Features
es: Características
nl: Functies

source: Pricing
es: Precios
nl: Prijzen

source: Testimonials
es: Testimonios
nl: Getuigenissen

source: Dashboard
es: Panel de Control

source: Logout
es: Cerrar Sesión
nl: Uitloggen

source: Login
es: Iniciar Sesión
nl: Inloggen

source: Get Started
es: Comenzar
nl: Beginnen

source: Learn a new language at your own pace!
es: ¡Aprende un nuevo idioma a tu ritmo!
nl: Leer een nieuwe taal op je eigen tempo!

source: Everything you need to learn a foreign language, at your own pace and wherever you are.
es: Todo lo que necesitas para aprender un idioma extranjero, a tu ritmo y donde quieras.
nl: Alles wat je nodig hebt om een vreemde taal te leren, op je eigen tempo en waar je ook bent.

source: Start for Free
es: Comenzar Gratis
nl: Gratis Beginnen

source: Discover Our Apps
es: Descubre Nuestras Apps
nl: Ontdek Onze Apps

source: Access Dashboard
es: Acceder al Panel
nl: Ga naar Dashboard

source: My Notes
es: Mis Notas
nl: Mijn Notities

source: App Preview
es: Vista Previa de la App
nl: App Voorvertoning

source: (Interactive Demo)
es: (Demo Interactiva)
nl: (Interactieve Demo)

source: Which language would you like to learn?
es: ¿Qué idioma te gustaría aprender?
nl: Welke taal wil je leren?

source: Available Languages
es: Idiomas Disponibles
nl: Beschikbare Talen

source: Learning Units
es: Unidades de Aprendizaje
nl: Leereenheden

source: Interactive Lessons
es: Lecciones Interactivas
nl: Interactieve Lessen

source: Words and Expressions
es: Palabras y Expresiones
nl: Woorden en Uitdrukkingen

source: Why Choose Linguify?
es: ¿Por qué elegir Linguify?
nl: Waarom Linguify kiezen?

source: Interactive Learning
es: Aprendizaje Interactivo
nl: Interactief Leren

source: Smart Flashcards
es: Flashcards Inteligentes
nl: Slimme Flashcards

source: Centralized Notebook
es: Cuaderno Centralizado
nl: Gecentraliseerd Notitieboek

source: Progress Tracking
es: Seguimiento del Progreso
nl: Voortgang Bijhouden

source: Product
es: Producto

source: Support
es: Soporte
nl: Ondersteuning

source: Help Center
es: Centro de Ayuda
nl: Helpcentrum

source: Contact
es: Contacto

source: Privacy
es: Privacidad

source: Terms
es: Términos
nl: Voorwaarden

source: All rights reserved
es: Todos los derechos reservados
nl: Alle rechten voorbehouden

source: Made with ❤️ in France
es: Hecho con ❤️ en Francia
nl: Gemaakt met ❤️ in Frankrijk

source: Commencer
es: Comenzar
nl: Beginnen

source: Apprenez une nouvelle langue à votre rythme !
es: ¡Aprende un nuevo idioma a tu ritmo!
nl: Leer een nieuwe taal in je eigen tempo!

source: Tout ce dont vous avez besoin pour apprendre une langue étrangère, à votre rythme et où que vous soyez.
es: Todo lo que necesitas para aprender un idioma extranjero, a tu ritmo y donde quiera que estés.
nl: Alles wat je nodig hebt om een vreemde taal te leren, in je eigen tempo en waar je ook bent.

source: Commencer gratuitement
es: Comenzar Gratis
nl: Gratis Beginnen

source: Découvrir nos applications
es: Descubrir Nuestras Apps
nl: Ontdek Onze Apps

source: Accéder au Dashboard
es: Acceder al Panel
nl: Toegang tot Dashboard

source: Mes Notes
es: Mis Notas
nl: Mijn Notities

source: Aperçu de l'application
es: Vista Previa de la App
nl: App Voorvertoning

source: (Démonstration interactive)
es: (Demostración Interactiva)
nl: (Interactieve Demo)

source: Quelle langue souhaitez-vous apprendre ?
es: ¿Qué idioma te gustaría aprender?
nl: Welke taal zou je willen leren?

source: Sélection de langue à apprendre
es: Selección de idioma a aprender
nl: Selectie van te leren taal

source: Langues disponibles
es: Idiomas Disponibles
nl: Beschikbare Talen

source: Unités d'apprentissage
es: Unidades de Aprendizaje
nl: Leereenheden

source: Leçons interactives
es: Lecciones Interactivas
nl: Interactieve Lessen

source: Mots et expressions
es: Palabras y Expresiones
nl: Woorden en Uitdrukkingen

source: Pourquoi choisir Linguify ?
es: ¿Por qué elegir Linguify?
nl: Waarom Linguify kiezen?

source: Notre plateforme a été conçue par des experts en linguistique et en pédagogie pour maximiser votre progression.
es: Nuestra plataforma ha sido diseñada por expertos en lingüística y pedagogía para maximizar tu progreso.
nl: Ons platform is ontworpen door experts in taalkunde en pedagogie om je vooruitgang te maximaliseren.

source: Apprentissage Interactif
es: Aprendizaje Interactivo
nl: Interactief Leren

source: Modules d'apprentissage interactifs adaptés à votre rythme et à votre niveau.
es: Módulos de aprendizaje interactivos adaptados a tu ritmo y nivel.
nl: Interactieve leermodules aangepast aan je tempo en niveau.

source: Flashcards Intelligentes
es: Flashcards Inteligentes
nl: Slimme Flashcards

source: Outils de mémorisation efficaces pour une rétention rapide du vocabulaire.
es: Herramientas de memorización efectivas para una retención rápida del vocabulario.
nl: Effectieve geheugentools voor snelle vocabulaire retentie.

source: Notebook Centralisé
es: Cuaderno Centralizado
nl: Gecentraliseerd Notitieboek

source: Prise de notes centralisée avec organisation intelligente et recherche avancée.
es: Toma de notas centralizada con organización inteligente y búsqueda avanzada.
nl: Gecentraliseerde notities met slimme organisatie en geavanceerd zoeken.

source: Suivi de Progression
es: Seguimiento del Progreso
nl: Voortgangsvolging

source: Visualisez vos progrès et définissez des objectifs réalisables avec des graphiques détaillés.
es: Visualiza tu progreso y establece objetivos alcanzables con gráficos detallados.
nl: Visualiseer je vooruitgang en stel haalbare doelen met gedetailleerde grafieken.

source: Changer de langue
es: Cambiar Idioma
nl: Taal Wijzigen

source: Legal
nl: Juridisch
