Repository: lp-linguify/linguify
Catalog: backend/public_web/i18n/*/LC_MESSAGES/django.po
Languages: cs, de, el, fi, hu, it, nl, pl, pt, ro, ru, sv, tr, uk

source: Open Linguify - Open source educational apps platform
de: Open Linguify - Open-Source-Plattform für Bildungsapps
it: Open Linguify - Piattaforma open source di app educative
nl: Open Linguify - Open source educatieve apps platform
pl: Open Linguify - Platforma aplikacji edukacyjnych open source
pt: Open Linguify - Plataforma open source de aplicações educacionais
ru: Open Linguify - Платформа образовательных приложений с открытым исходным кодом
sv: Open Linguify - Öppen källkod utbildningsapp plattform
uk: Open Linguify - Платформа освітніх додатків з відкритим кодом

source: Open Linguify is an open source educational apps platform: memorization system, flashcards, note-taking, quizzes, collaborative chat, classrooms and much more. Discover our tools to revolutionize learning.
de: Open Linguify ist eine Open-Source-Plattform für Bildungsapps: Merksystem, Karteikarten, Notizen, Quiz, kollaborativer Chat, Klassenzimmer und vieles mehr. Entdecken Sie unsere Tools zur Revolution des Lernens.
it: Open Linguify è una piattaforma open source di app educative: sistema di memorizzazione, flashcard, presa di appunti, quiz, chat collaborativa, aule e molto altro. Scopri i nostri strumenti per rivoluzionare l'apprendimento.
nl: Open Linguify is een open source educatieve apps platform: memorisatiesysteem, flashcards, notities maken, quizzen, collaboratieve chat, klaslokalen en veel meer. Ontdek onze tools om het leren te revolutioneren.
pl: Open Linguify to platforma aplikacji edukacyjnych open source: system zapamiętywania, fiszki, notatki, quizy, czat współpracy, klasy i wiele więcej. Odkryj nasze narzędzia rewolucjonizujące naukę.
pt: Open Linguify é uma plataforma open source de aplicações educacionais: sistema de memorização, flashcards, anotações, questionários, chat colaborativo, salas de aula e muito mais. Descubra as nossas ferramentas para revolucionar a aprendizagem.
ru: Open Linguify - это платформа образовательных приложений с открытым исходным кодом: система запоминания, карточки, заметки, викторины, совместный чат, классы и многое другое. Откройте наши инструменты для революции в обучении.
sv: Open Linguify är en öppen källkod utbildningsapp plattform: minnessystem, flashkort, anteckningar, quiz, samarbetschatt, klassrum och mycket mer. Upptäck våra verktyg för att revolutionera lärandet.
uk: Open Linguify - це платформа освітніх додатків з відкритим кодом: система запам'ятовування, картки, нотатки, вікторини, спільний чат, класи та багато іншого. Відкрийте наші інструменти для революції в навчанні.

source: Open Linguify - Open source platform for modern education
de: Open Linguify - Open-Source-Plattform für moderne Bildung
it: Open Linguify - Piattaforma open source per l'educazione moderna
nl: Open Linguify - Open source platform voor modern onderwijs
pl: Open Linguify - Platforma open source dla nowoczesnej edukacji
pt: Open Linguify - Plataforma open source para educação moderna
ru: Open Linguify - Платформа с открытым исходным кодом для современного образования
sv: Open Linguify - Öppen källkod plattform för modern utbildning
uk: Open Linguify - Платформа з відкритим кодом для сучасної освіти

source: Discover a complete suite of open source educational apps: smart memorization, flashcards, note-taking, interactive quizzes, collaborative chat, virtual classrooms and much more. Revolutionize the way you learn.
de: Entdecken Sie eine vollständige Suite von Open-Source-Bildungsapps: intelligente Memorierung, Karteikarten, Notizen, interaktive Quiz, kollaborativer Chat, virtuelle Klassenzimmer und vieles mehr. Revolutionieren Sie Ihre Art zu lernen.
it: Scopri una suite completa di app educative open source: memorizzazione intelligente, flashcard, presa di appunti, quiz interattivi, chat collaborativa, aule virtuali e molto altro. Rivoluziona il tuo modo di imparare.
nl: Ontdek een complete suite van open source educatieve apps: slimme memorisatie, flashcards, notities maken, interactieve quizzen, collaboratieve chat, virtuele klaslokalen en veel meer. Revolutioneer de manier waarop je leert.
pl: Odkryj kompletny pakiet aplikacji edukacyjnych open source: inteligentne zapamiętywanie, fiszki, notatki, interaktywne quizy, czat współpracy, wirtualne klasy i wiele więcej. Zrewolucjonizuj sposób nauki.
pt: Descubra uma suite completa de aplicações educacionais open source: memorização inteligente, flashcards, anotações, questionários interativos, chat colaborativo, salas de aula virtuais e muito mais. Revolucione a sua forma de aprender.
ru: Откройте полный набор образовательных приложений с открытым исходным кодом: умное запоминание, карточки, заметки, интерактивные викторины, совместный чат, виртуальные классы и многое другое. Революционизируйте свой способ обучения.
sv: Upptäck en komplett svit av öppen källkod utbildningsappar: smart memorering, flashkort, anteckningar, interaktiva quiz, samarbetschatt, virtuella klassrum och mycket mer. Revolutionera ditt sätt att lära.
uk: Відкрийте повний набір освітніх додатків з відкритим кодом: розумне запам'ятовування, картки, нотатки, інтерактивні вікторини, спільний чат, віртуальні класи та багато іншого. Революціонізуйте свій спосіб навчання.

source: Complete suite of open source educational apps: memorization, flashcards, notes, quizzes, collaborative chat and much more.
de: Vollständige Suite von Open-Source-Bildungsapps: Memorierung, Karteikarten, Notizen, Quiz, kollaborativer Chat und vieles mehr.
it: Suite completa di app educative open source: memorizzazione, flashcard, appunti, quiz, chat collaborativa e molto altro.
nl: Complete suite van open source educatieve apps: memorisatie, flashcards, notities, quizzen, collaboratieve chat en veel meer.
pl: Kompletny pakiet aplikacji edukacyjnych open source: zapamiętywanie, fiszki, notatki, quizy, czat współpracy i wiele więcej.
pt: Suite completa de aplicações educacionais open source: memorização, flashcards, anotações, questionários, chat colaborativo e muito mais.
ru: Полный набор образовательных приложений с открытым исходным кодом: запоминание, карточки, заметки, викторины, совместный чат и многое другое.
sv: Komplett svit av öppen källkod utbildningsappar: memorering, flashkort, anteckningar, quiz, samarbetschatt och mycket mer.
uk: Повний набір освітніх додатків з відкритим кодом: запам'ятовування, картки, нотатки, вікторини, спільний чат та багато іншого.

source: Open Source Education Apps
de: Open-Source-Bildungsapps
it: App Educative Open Source
nl: Open Source Educatieve Apps
pl: Aplikacje Edukacyjne Open Source
pt: Aplicações Educacionais Open Source
ru: Образовательные приложения с открытым исходным кодом
sv: Öppen Källkod Utbildningsappar
uk: Освітні додатки з відкритим кодом

source: A complete suite of open source educational apps: memorization, flashcards, note-taking, quizzes, collaborative chat and much more.
de: Eine vollständige Suite von Open-Source-Bildungsapps: Memorierung, Karteikarten, Notizen, Quiz, kollaborativer Chat und vieles mehr.
it: Una suite completa di app educative open source: memorizzazione, flashcard, presa di appunti, quiz, chat collaborativa e molto altro.
nl: Een complete suite van open source educatieve apps: memorisatie, flashcards, notities maken, quizzen, collaboratieve chat en veel meer.
pl: Kompletny pakiet aplikacji edukacyjnych open source: zapamiętywanie, fiszki, notatki, quizy, czat współpracy i wiele więcej.
pt: Uma suite completa de aplicações educacionais open source: memorização, flashcards, anotações, questionários, chat colaborativo e muito mais.
ru: Полный набор образовательных приложений с открытым исходным кодом: запоминание, карточки, заметки, викторины, совместный чат и многое другое.
sv: En komplett svit av öppen källkod utbildningsappar: memorering, flashkort, anteckningar, quiz, samarbetschatt och mycket mer.
uk: Повний набір освітніх додатків з відкритим кодом: запам'ятовування, картки, нотатки, вікторини, спільний чат та багато іншого.

source: Start for free
de: Kostenlos beginnen
it: Inizia gratis
nl: Gratis beginnen
pl: Zacznij za darmo
pt: Começar grátis
ru: Начать бесплатно
sv: Börja gratis
uk: Почати безкоштовно

source: Discover our apps
de: Unsere Apps entdecken
it: Scopri le nostre app
nl: Ontdek onze apps
pl: Odkryj nasze aplikacje
pt: Descobrir as nossas aplicações
ru: Открыть наши приложения
sv: Upptäck våra appar
uk: Відкрити наші додатки

source: Access Dashboard
de: Dashboard aufrufen
it: Accedi alla Dashboard
nl: Toegang tot Dashboard
pl: Dostęp do panelu
pt: Aceder ao Dashboard
ru: Доступ к панели управления
sv: Kom åt instrumentpanel
uk: Доступ до панелі управління

source: open linguify, educational apps, flashcards, memorization, note-taking, quizzes, collaborative chat, classrooms, open source, education, learning
de: open linguify, bildungsapps, karteikarten, memorierung, notizen, quiz, kollaborativer chat, klassenzimmer, open source, bildung, lernen
it: open linguify, app educative, flashcard, memorizzazione, appunti, quiz, chat collaborativa, aule, open source, educazione, apprendimento
nl: open linguify, educatieve apps, flashcards, memorisatie, notities maken, quizzen, collaboratieve chat, klaslokalen, open source, onderwijs, leren
pl: open linguify, aplikacje edukacyjne, fiszki, zapamiętywanie, notatki, quizy, czat współpracy, klasy, open source, edukacja, nauka
pt: open linguify, aplicações educacionais, flashcards, memorização, anotações, questionários, chat colaborativo, salas de aula, open source, educação, aprendizagem
ru: open linguify, образовательные приложения, карточки, запоминание, заметки, викторины, совместный чат, классы, открытый исходный код, образование, обучение
sv: open linguify, utbildningsappar, flashkort, memorering, anteckningar, quiz, samarbetschatt, klassrum, öppen källkod, utbildning, lärande
uk: open linguify, освітні додатки, картки, запам'ятовування, нотатки, вікторини, спільний чат, класи, відкритий код, освіта, навчання

source: Features
cs: Funkce
de: Funktionen
el: Χαρακτηριστικά
fi: Ominaisuudet
hu: Funkciók
it: Funzionalità
nl: Functies
pl: Funkcje
pt: Funcionalidades
ro: Caracteristici
ru: Функции
sv: Funktioner
tr: Özellikler
uk: Функції

source: About
cs: O nás
de: Über uns
el: Σχετικά
fi: Tietoja
hu: Rólunk
it: Chi siamo
nl: Over ons
pl: O nas
pt: Sobre
ro: Despre
ru: О нас
sv: Om oss
tr: Hakkında
uk: Про нас

source: Educational Apps
nl: Educatieve Apps

source: Flashcards Created
nl: Flashcards Gemaakt

source: Quizzes Generated
nl: Quizzen Gegenereerd

source: Our Educational Apps
nl: Onze Educatieve Apps

source: Discover our suite of 5 apps designed to transform your learning experience. Choose one for free or access all with Premium.
nl: Ontdek onze suite van 5 apps ontworpen om je leerervaring te transformeren. Kies er één gratis of krijg toegang tot alle met Premium.

source: Courses
cs: Kurzy
el: Μάθηματα
fi: Kurssit
hu: Tanfolyamok
nl: Cursussen
ro: Cursuri
tr: Kurslar

source: Structured courses with progressive lessons, interactive exercises and personalized assessments.
nl: Gestructureerde cursussen met progressieve lessen, interactieve oefeningen en gepersonaliseerde beoordelingen.

source: Revision
nl: Herhaling

source: Spaced repetition system with smart flashcards for optimal memorization.
nl: Herhalingssysteem met slimme flashcards voor optimale memorisatie.

source: Notebook
nl: Notitieboek

source: Centralized note-taking with intelligent organization and advanced search.
nl: Gecentraliseerde notities met intelligente organisatie en geavanceerd zoeken.

source: Adaptive quiz system to test your knowledge and identify weak points.
nl: Adaptief quizsysteem om je kennis te testen en zwakke punten te identificeren.

source: Language AI
nl: Taal AI

source: AI assistant for natural conversations and intelligent real-time corrections.
nl: AI-assistent voor natuurlijke gesprekken en intelligente realtime correcties.

source: New Educational Apps Coming Soon
nl: Nieuwe Educatieve Apps Binnenkort Beschikbaar

source: Our teams are actively working on innovative new educational apps to enrich our learning ecosystem. These upcoming tools will offer even more ways to master languages.
nl: Onze teams werken actief aan innovatieve nieuwe educatieve apps om ons leerecosysteem te verrijken. Deze aankomende tools bieden nog meer manieren om talen onder de knie te krijgen.

source: AI Writing Assistant
nl: AI Schrijfassistent

source: Pronunciation Trainer
nl: Uitspraaktrainer

source: Cultural Immersion
nl: Culturele Onderdompeling

source: Grammar Checker
nl: Grammaticacontrole

source: Join the waiting list
nl: Doe mee met de wachtlijst

source: Coming in 2025
nl: Komend in 2025

source: Neuroscience-based language acquisition
nl: Neurowetenschappelijke taalverwerving

source: Native speaker community
nl: Gemeenschap van moedertaalsprekers

source: Industry-recognized certifications
nl: Door de industrie erkende certificeringen

source: Plans adapted to your needs
nl: Plannen aangepast aan je behoeften

source: Choose the offer that matches your goals and learning pace.
nl: Kies het aanbod dat past bij je doelen en leertempo.

source: Free
cs: Zdarma
el: Δωρεάν
fi: Ilmainen
hu: Ingyenes
nl: Gratis
ro: Gratuit
tr: Ücretsiz

source: forever
nl: voor altijd

source: Perfect for discovering the platform
nl: Perfect om het platform te ontdekken

source: Access to 1 app of your choice
nl: Toegang tot 1 app naar keuze

source: Full use of the chosen app
nl: Volledig gebruik van de gekozen app

source: Free updates
nl: Gratis updates

source: Community support
cs: Podpora komunity
el: Υποστήριξη κοινότητας
fi: Yhteisön tuki
hu: Közösségi támogatás
nl: Gemeenschapsondersteuning
ro: Suport comunitar
tr: Topluluk desteği

source: Most popular
nl: Meest populair

source: per month
nl: per maand

source: Full access to all applications
nl: Volledige toegang tot alle applicaties

source: Access to all applications
nl: Toegang tot alle applicaties

source: Courses: structured lessons
nl: Cursussen: gestructureerde lessen

source: Revision: unlimited flashcards
nl: Herhaling: onbeperkte flashcards

source: Notebook: unlimited notes
nl: Notitieboek: onbeperkte notities

source: Quiz & Language AI included
nl: Quiz & Taal AI inbegrepen

source: 7-day free trial
nl: 7 dagen gratis proefperiode

source: Ready to revolutionize your learning?
nl: Klaar om je leren te revolutioneren?

source: Join our community and access a complete suite of open source educational apps.
nl: Sluit je aan bij onze gemeenschap en krijg toegang tot een complete suite van open source educatieve apps.

source: Go to Dashboard
nl: Ga naar Dashboard

source: My Notes
nl: Mijn Notities

source: Log In
nl: Inloggen

source: Sign Up
nl: Registreren

source: Open source educational apps platform: memorization, flashcards, notes, quizzes and collaborative chat.
nl: Open source educatieve apps platform: memorisatie, flashcards, notities, quizzen en collaboratieve chat.

source: Pricing
cs: Ceny
el: Τιμολόγιο
fi: Hinnoittelu
hu: Árak
nl: Prijzen
ro: Prețuri
tr: Fiyatlandırma

source: Resources
nl: Bronnen

source: Documentation
nl: Documentatie

source: Community
nl: Gemeenschap

source: Company
cs: Společnost
el: Εταιρία
fi: Yritys
hu: Cég
nl: Bedrijf
ro: Companie
tr: Şirket

source: Careers
cs: Kariéra
el: Καριέρα
fi: Urat
hu: Karrier
nl: Carrières
ro: Cariere
tr: Kariyer

source: Press
cs: Tisk
el: Τύπος
fi: Lehdistö
hu: Sajtó
nl: Pers
ro: Presă
tr: Basın

source: Support
cs: Podpora
el: Υποστήριξη
fi: Tuki
hu: Támogatás
nl: Ondersteuning
ro: Suport
tr: Destek

source: Help Center
cs: Centrum nápovědy
el: Κέντρο Βοήθειας
fi: Ohjekeskus
hu: Segítség Központ
nl: Helpcentrum
ro: Centru de Ajutor
tr: Yardım Merkezi

source: Report a bug
nl: Rapporteer een bug

source: Contact us
nl: Neem contact op

source: © 2025 Open Linguify. All rights reserved.
nl: © 2025 Open Linguify. Alle rechten voorbehouden.

source: Terms
nl: Voorwaarden

source: Open Linguify - Learn languages
nl: Open Linguify - Leer talen

source: Open source platform for learning languages
nl: Open source platform voor het leren van talen

source: Back to home
nl: Terug naar startpagina

source: Sign in to your account
nl: Meld je aan bij je account

source: Login
nl: Inloggen

source: Email or username
nl: E-mail of gebruikersnaam

source: Password
nl: Wachtwoord

source: Remember me
nl: Onthoud mij

source: Forgot password?
nl: Wachtwoord vergeten?

source: Don't have an account?
nl: Nog geen account?

source: Create an account
nl: Account aanmaken

source: or
nl: of

source: Invalid username or password.
nl: Ongeldige gebruikersnaam of wachtwoord.

source: Welcome, %(username)s!
nl: Welkom, %(username)s!

source: Learn Languages with AI - Interactive Language Learning Platform
cs: Učte se jazyky s AI - Interaktivní platforma pro učení jazyků
el: Μάθετε Γλώσσες με AI - Διαδραστική Πλατφόρμα Εκμάθησης Γλωσσών
fi: Oppi kieliä AI:n kanssa - Interaktiivinen kielten oppimisalusta
hu: Tanulj Nyelveket AI-val - Interaktív Nyelvtanulási Platform
ro: Învățați Limbi cu AI - Platformă Interactivă de Învățare a Limbilor
tr: Yapay Zeka ile Dil Öğrenin - İnteraktif Dil Öğrenme Platformu

source: Master new languages with our AI-powered interactive platform. Personalized lessons, real-time feedback, and engaging exercises for effective language learning.
cs: Zvládněte nové jazyky s naší interaktivní platformou pohaněnou AI. Personalizované lekce, zpětnou vazbu v reálném čase a poutavé cvičení pro efektivní učení jazyků.
el: Κατακτήστε νέες γλώσσες με την διαδραστική μας πλατφόρμα AI. Εξατομικευμένα μαθήματα, ανατροφοδότηση σε πραγματικό χρόνο και συναρπαστικές ασκήσεις για αποτελεσματική εκμάθηση γλωσσών.
fi: Hallitse uusia kieliä AI-käyttöisellä interaktiivisella alustalla. Personoidut oppitunnit, reaaliaikainen palaute ja kiinnostavat harjoitukset tehokkaaseen kielten oppimiseen.
hu: Sajátítsd el az új nyelveket AI-alapú interaktív platformunkkal. Személyre szabott leckék, valós idejű visszajelzés és vonzó gyakorlatok a hatékony nyelvtanulásért.
ro: Stăpâniți limbi noi cu platforma noastră interactivă bazată pe AI. Lecții personalizate, feedback în timp real și exerciții captivante pentru învățarea eficientă a limbilor.
tr: Yapay zeka destekli interaktif platformumuzla yeni dillerde ustalaşın. Etkili dil öğrenimi için kişiselleştirilmiş dersler, gerçek zamanlı geri bildirim ve ilgi çekici alıştırmalar.

source: language learning, AI, interactive, personalized, lessons, multilingual, education
cs: učení jazyků, AI, interaktivní, personalizované, lekce, vícejazyčné, vzdělání
el: εκμάθηση γλωσσών, AI, διαδραστικό, εξατομικευμένο, μαθήματα, πολυγλωσσικό, εκπαίδευση
fi: kielten oppiminen, AI, interaktiivinen, personoitu, oppitunnit, monikielinen, koulutus
hu: nyelvtanulás, AI, interaktív, személyre szabott, leckék, többnyelű, oktatás
ro: învățarea limbilor, AI, interactiv, personalizat, lecții, multilingv, educație
tr: dil öğrenme, yapay zeka, interaktif, kişiselleştirilmiş, dersler, çok dilli, eğitim

source: Home
cs: Domů
el: Αρχική
fi: Koti
hu: Főoldal
ro: Acasă
tr: Ana Sayfa

source: Contact
cs: Kontakt
de: Kontakt
el: Επικοινωνία
fi: Yhteystiedot
hu: Kapcsolat
it: Contatti
pl: Kontakt
pt: Contacto
ru: Контакты
sv: Kontakt
tr: İletişim
uk: Контакти

source: Get Started
cs: Začít
el: Ξεκινήστε
fi: Aloita
hu: Kezdjünk Bele
ro: Începeți
tr: Başlayın

source: Sign In
cs: Přihlásit se
el: Σύνδεση
fi: Kirjaudu sisään
hu: Bejelentkezés
ro: Autentificare
tr: Giriş Yap

source: Language
cs: Jazyk
el: Γλώσσα
fi: Kieli
hu: Nyelv
ro: Limbă
tr: Dil

source: Master Languages with AI
cs: Zvládněte jazyky s AI
el: Κατακτήστε Γλώσσες με AI
fi: Hallitse kieliä AI:n kanssa
hu: Sajátítsd el a Nyelveket AI-val
ro: Stăpâniți Limbile cu AI
tr: Yapay Zeka ile Dillerde Ustalaşın

source: Experience the future of language learning with our AI-powered platform. Personalized lessons, real-time feedback, and interactive exercises designed just for you.
cs: Zažijte budoucnost učení jazyků s naší AI platformou. Personalizované lekce, zpětnou vazbu v reálném čase a interaktivní cvičení navržená přísně pro vás.
el: Ζήστε το μέλλον της εκμάθησης γλωσσών με την πλατφόρμα AI. Εξατομικευμένα μαθήματα, ανατροφοδότηση σε πραγματικό χρόνο και διαδραστικές ασκήσεις σχεδιασμένες αποκλειστικά για εσάς.
fi: Koe kielten oppimisen tulevaisuus AI-käyttöisellä alustalla. Personoidut oppitunnit, reaaliaikainen palaute ja interaktiiviset harjoitukset, jotka on suunniteltu juuri sinulle.
hu: Éld át a nyelvtanulás jövőjét AI-alapú platformunkkal. Személyre szabott leckék, valós idejű visszajelzés és interaktív gyakorlatok, amelyeket kifejezetten neked terveztünk.
ro: Experimențați viitorul învățării limbilor cu platforma noastră bazată pe AI. Lecții personalizate, feedback în timp real și exerciții interactive concepute special pentru voi.
tr: Yapay zeka destekli platformumuzla dil öğreniminin geleceğini deneyimleyin. Sadece sizin için tasarlanmış kişiselleştirilmiş dersler, gerçek zamanlı geri bildirim ve interaktif alıştırmalar.

source: Start Learning Now
cs: Začněte se učit teď
el: Ξεκινήστε τη Μάθηση Τώρα
fi: Aloita oppiminen nyt
hu: Kezdj el Tanulni Most
ro: Începeți să Învățați Acum
tr: Şimdi Öğrenmeye Başlayın

source: Watch Demo
cs: Sledovat demo
el: Παρακολουθήστε Demo
fi: Katso demo
hu: Demo Megtekintése
ro: Urmăriți Demo-ul
tr: Demo İzleyin

source: Active Learners
cs: Aktivní studenti
el: Ενεργοί Μαθητές
fi: Aktiiviset oppijat
hu: Aktív Tanulók
ro: Cursanti Activi
tr: Aktif Öğrenci

source: Languages Available
cs: Dostupné jazyky
el: Διαθέσιμες Γλώσσες
fi: Saatavilla olevat kielet
hu: Elérhető Nyelvek
ro: Limbi Disponibile
tr: Mevcut Dil

source: Lessons Completed
cs: Dokončené lekce
el: Ολοκληρωμένα Μαθήματα
fi: Suoritetut oppitunnit
hu: Befejezett Leckék
ro: Lecții Finalizate
tr: Tamamlanan Ders

source: Success Rate
cs: Úspěšnost
el: Ποσοστό Επιτυχίας
fi: Onnistumisprosentti
hu: Sikerességi Arány
ro: Rata de Succes
tr: Başarı Oranı

source: Why Choose Our Platform?
cs: Proč si vybrat naši platformu?
el: Γιατί να Επιλέξετε την Πλατφόρμά μας;
fi: Miksi valita meidän alustamme?
hu: Miért Válassza a Platformunkat?
ro: De ce să Alegeți Platforma Noastră?
tr: Neden Platformumuzu Seçmelisiniz?

source: AI-Powered Learning
cs: Učení pohaněné AI
el: Μάθηση με AI
fi: AI-käyttöinen oppiminen
hu: AI-Alapú Tanulás
ro: Învățare Bazată pe AI
tr: Yapay Zeka Destekli Öğrenme

source: Our advanced AI adapts to your learning style and pace, providing personalized recommendations and feedback.
cs: Naše pokročilá AI se přizpůsobuje vašemu stylu a tempu učení a poskytuje personalizovaná doporučení a zpětnou vazbu.
el: Το προηγμένο AI μας προσαρμόζεται στο στυλ και ρυθμό εκμάθησής σας, παρέχοντας εξατομικευμένες συστάσεις και ανατροφοδότηση.
fi: Kehittynyt AI:mme mukautuu oppimistyyliin ja tahtiisi, tarjoten personoituja suosituksia ja palautetta.
hu: Fejlett AI-nk alkalmazkodik a tanulási stílusához és üteméhez, személyre szabott ajánlásokat és visszajelzést nyújtva.
ro: AI-ul nostru avansat se adaptează stilului și ritmului vostru de învățare, oferind recomandări personalizate și feedback.
tr: Gelişmiş yapay zekamız öğrenme tarzınıza ve hızınıza uyum sağlar, kişiselleştirilmiş öneriler ve geri bildirim sağlar.

source: Interactive Exercises
cs: Interaktivní cvičení
el: Διαδραστικές Ασκήσεις
fi: Interaktiiviset harjoitukset
hu: Interaktív Gyakorlatok
ro: Exerciții Interactive
tr: İnteraktif Alıştırmalar
