Repository: lp-linguify/linguify
Catalog: backend/public_web/i18n/*/LC_MESSAGES/django.po
Languages: cs, de, el, fi, hu, it, nl, pl, pt, ro, ru, sv, tr, uk

source: Engage with dynamic exercises including speaking practice, listening comprehension, and writing challenges.
cs: Zapojte se do dynamických cvičení včetně nácvikem mluvení, poslechového porozumění a pisících výzev.
el: Συμμετέχετε σε δυναμικές ασκήσεις που περιλαμβάνουν εξάσκηση ομιλίας, κατανόηση ακρόασης και προκλήσεις γραφής.
fi: Osallistu dynaamisiin harjoituksiin, mukaan lukien puhumisharjoitukset, kuullun ymmärtäminen ja kirjoitushaasteet.
hu: Vegyen részt dinamikus gyakorlatokban, beleértve a beszédgyakorlatot, hallásértést és írási kihivásokat.
ro: Implicați-vă în exerciții dinamice care includ practica vorbirii, înțelegerea auditivă și provocări de scriere.
tr: Konuşma pratiği, dinleme anlama ve yazma zorlukları dahil olmak üzere dinamik alıştırmalarla etkileşim kurun.

source: Progress Tracking
cs: Sledování pokroku
el: Παρακολούθηση Προόδου
fi: Edistymisen seuranta
hu: Haladás Követése
ro: Urmarea Progresului
tr: İlerleme Takibi

source: Monitor your learning journey with detailed analytics and progress reports to stay motivated.
cs: Sledujte svou vzdělávací cestu s podrobnými analytickými údaji a zprávami o pokroku, abyste zůstali motivováni.
el: Παρακολουθήστε το μαθησιακό σας ταξίδι με λεπτομερή αναλυτική και αναφορές προόδου για να παραμείνετε κινητοποιημένοι.
fi: Seuraa oppimismatkaasi yksityiskohtaisten analytiikkojen ja edistymisraporttien avulla pysyy motivoituneena.
hu: Kövesse nyomon tanulási útját részletes elemzésekkel és haladási jelentésekkel, hogy motivált maradjon.
ro: Monitorizați-vă călătoria de învățare cu analitici detaliate și rapoarte de progres pentru a rămâne motivați.
tr: Motivasyonunuzu korumak için detaylı analitik ve ilerleme raporlarıyla öğrenme yolculuğunuzu izleyin.

source: Multi-Device Access
cs: Přístup z více zařízení
el: Πρόσβαση σε Πολλαπλές Συσκευές
fi: Monilaitepääsy
hu: Több Eszközös Hozzáférés
ro: Acces pe Multiple Dispozitive
tr: Çoklu Cihaz Erişimi

source: Learn anywhere, anytime with seamless synchronization across all your devices.
cs: Učte se kdekoli, kdykoli s bezproblémovou synchronizací ve všech vašich zařízeních.
el: Μαθαίνετε οπουδήποτε, οποτεδήποτε με απρόσκοπτη συγχρονισμό σε όλες τις συσκευές σας.
fi: Oppi missä tahansa, milloin tahansa saumattomalla synkronoinnilla kaikissa laitteissa.
hu: Tanuljon bárhol, bármikor zökkenőmentes szinkronizációval az összes eszközén.
ro: Învățați oriunde, oricând cu sincronizare perfectă pe toate dispozitivele voastre.
tr: Tüm cihazlarınızda sorunsuz senkronizasyonla her yerde, her zaman öğrenin.

source: Expert Content
cs: Odborný obsah
el: Περιεχόμενο Ειδικών
fi: Asiantuntijasisältö
hu: Szakmai Tartalom
ro: Conținut de Expert
tr: Uzman İçerik

source: Curriculum designed by language experts and native speakers for authentic learning experiences.
cs: Kurikulum navržené jazykovými experty a rozenými mluvčími pro autentické vzdělávací zážitky.
el: Πρόγραμμα σπουδών σχεδιασμένο από ειδικούς γλωσσών και φυσικούς ομιλητές για αυθεντικές εμπειρίες εκμάθησης.
fi: Kielten asiantuntijoiden ja äidinkielenpuhujien suunnittelema opetussuunnitelma aidoille oppimiskokemuksille.
hu: Nyelvi szakemberek és anyanyelű beszélők által tervezett tanterv autentikus tanulási élményekhez.
ro: Curriculum conceput de experți în limbi și vorbitori nativi pentru experiențe autentice de învățare.
tr: Otantik öğrenme deneyimleri için dil uzmanları ve ana dil konuşanları tarafından tasarlanmış müfredat.

source: Community Support
cs: Podpora komunity
el: Υποστήριξη Κοινότητας
fi: Yhteisön tuki
hu: Közösségi Támogatás
ro: Suport Comunitar
tr: Topluluk Desteği

source: Join a vibrant community of learners and get support from fellow students and instructors.
cs: Připojte se k živé komunitě studentů a získejte podporu od spolužáků a instruktorů.
el: Ενταχθείτε σε μια ζωντανή κοινότητα μαθητών και λάβετε υποστήριξη από συναδέλφους φοιτητές και εκπαιδευτές.
fi: Liity elävään oppijoiden yhteisöön ja saa tukea opiskelutovereilta ja ohjaajilta.
hu: Csatlakozzon a tanulók élénk közösségéhez, és kapjon támogatást társtanulóiktól és oktatóiktól.
ro: Alăturați-vă unei comunități vibrante de cursanti și primiți suport de la colegii studenți și instructori.
tr: Canlı bir öğrenci topluluğuna katılın ve diğer öğrenciler ile eğitmenlerden destek alın.

source: Choose Your Plan
cs: Vyberte si svůj plán
el: Επιλέξτε το Πλάνο σας
fi: Valitse suunnitelmasi
hu: Válassza ki a Tervét
ro: Alegeți-vă Planul
tr: Planınızı Seçin

source: Start your language learning journey with the plan that fits your needs.
cs: Začněte svou cestu učení jazyka s plánem, který vyhovuje vašim potřebám.
el: Ξεκινήστε το μαθησιακό σας ταξίδι με το πλάνο που ταιριάζει στις ανάγκες σας.
fi: Aloita kielten oppimismatkasi suunnitelmalla, joka sopii tarpeisiisi.
hu: Kezdje el nyelvtanulási útját azzal a tervvel, amely megfelel az igényeinek.
ro: Începeți călătoria de învățare a limbii cu planul care se potrivește nevoilor voastre.
tr: İhtiyaçlarınıza uygun planla dil öğrenme yolculuğunuza başlayın.

source: Perfect for getting started
cs: Ideální pro začátky
el: Τέλειο για να ξεκινήσετε
fi: Täydellinen aloittamiseen
hu: Tökéletes a kezdéshez
ro: Perfect pentru început
tr: Başlamak için mükemmel

source: Access to basic lessons
cs: Přístup k základním lekcím
el: Πρόσβαση σε βασικά μαθήματα
fi: Pääsy perustunnille
hu: Alap leckékhez való hozzáférés
ro: Acces la lecții de bază
tr: Temel derslere erişim

source: Limited AI features
cs: Omezené AI funkce
el: Περιορισμένα χαρακτηριστικά AI
fi: Rajoitetut AI-ominaisuudet
hu: Korlátozott AI funkciók
ro: Caracteristici AI limitate
tr: Sınırlı yapay zeka özellikleri

source: Start Free
cs: Začít zdarma
el: Ξεκινήστε Δωρεάν
fi: Aloita ilmaiseksi
hu: Ingyenes Kezdés
ro: Începeți Gratuit
tr: Ücretsiz Başlayın

source: month
cs: měsíc
el: μήνα
fi: kuukausi
hu: hónap
ro: lună
tr: ay

source: Best for serious learners
cs: Nejlepší pro vážné studenty
el: Καλύτερο για σοβαρούς μαθητές
fi: Paras vakaviin oppijoihin
hu: A legjobb komoly tanulóknak
ro: Cel mai bun pentru cursantii serioși
tr: Ciddi öğrenciler için en iyi

source: Unlimited lessons
cs: Neomezené lekce
el: Απεριόριστα μαθήματα
fi: Rajoittamattomat oppitunnit
hu: Korlátlan leckék
ro: Lecții nelimitate
tr: Sınırsız dersler

source: Full AI-powered features
cs: Plné AI funkce
el: Πλήρη χαρακτηριστικά AI
fi: Täydet AI-käyttöiset ominaisuudet
hu: Teljes AI-alapú funkciók
ro: Caracteristici complete bazate pe AI
tr: Tam yapay zeka destekli özellikler

source: Priority support
cs: Prioritní podpora
el: Προτεραιότητα υποστήριξης
fi: Ensisijainen tuki
hu: Prioritásos támogatás
ro: Suport prioritar
tr: Öncelikli destek

source: Offline access
cs: Offline přístup
el: Πρόσβαση εκτός σύνδεσης
fi: Offline-pääsy
hu: Offline hozzáférés
ro: Acces offline
tr: Çevrimdışı erişim

source: Choose Pro
cs: Vyberte Pro
el: Επιλέξτε Pro
fi: Valitse Pro
hu: Válassza a Pro-t
ro: Alegeți Pro
tr: Pro'yu Seçin

source: Enterprise
cs: Podnikový
el: Επιχείρηση
fi: Yritys
hu: Vállalati
tr: Kurumsal

source: For teams and organizations
cs: Pro týmy a organizace
el: Για ομάδες και οργανισμούς
fi: Tiimeille ja organisaatioille
hu: Csapatoknak és szervezeteknek
ro: Pentru echipe și organizații
tr: Takımlar ve organizasyonlar için

source: Custom solutions
cs: Vlastní řešení
el: Προσαρμοσμένες λύσεις
fi: Räätälöidyt ratkaisut
hu: Egyedi megoldások
ro: Soluții personalizate
tr: Özel çözümler

source: Advanced analytics
cs: Pokročilé analytiky
el: Προηγμένη αναλυτική
fi: Kehittynyt analytiikka
hu: Fejlett elemzések
ro: Analitici avansate
tr: Gelişmiş analitik

source: Dedicated support
cs: Věnovaná podpora
el: Αφιερωμένη υποστήριξη
fi: Omistettu tuki
hu: Dedikált támogatás
ro: Suport dedicat
tr: Özel destek

source: Contact Sales
cs: Kontaktovat prodej
el: Επικοινωνία με τις Πωλήσεις
fi: Ota yhteyttä myyntiin
hu: Kapcsolat az Értékesítéssel
ro: Contactați Vânzările
tr: Satış ile İletişime Geçin

source: Ready to start your language learning journey?
cs: Připraveni začít svou cestu učení jazyka?
el: Έτοιμοι να ξεκινήσετε το μαθησιακό σας ταξίδι;
fi: Valmis aloittamaan kielten oppimismatkasi?
hu: Kész elkezdése a nyelvtanulási útját?
ro: Pregătiți să vă începeți călătoria de învățare a limbii?
tr: Dil öğrenme yolculuğunuza başlamaya hazır mısınız?

source: Join thousands of learners who have already transformed their language skills with our AI-powered platform.
cs: Připojte se k tisícům studentů, kteří již transformovali své jazykové dovednosti s naší AI platformou.
el: Ενταχθείτε σε χιλιάδες μαθητών που έχουν ήδη μετασχηματίσει τις γλωσσικές τους δεξιότητες με την πλατφόρμά μας AI.
fi: Liity tuhansiin oppijoihin, jotka ovat jo muuttaneet kielitaitojaan AI-käyttöisellä alustalla.
hu: Csatlakozzon a tanulók ezreihez, akik már átalakították nyelvi képességeiket AI-alapú platformunkkal.
ro: Alăturați-vă miilor de cursanti care și-au transformat deja competențele lingvistice cu platforma noastră bazată pe AI.
tr: Yapay zeka destekli platformumuzla dil becerilerini dönüştürmüş binlerce öğrenciye katılın.

source: Product
cs: Produkt
el: Προϊόν
fi: Tuote
hu: Termék
ro: Produs
tr: Ürün

source: Mobile App
cs: Mobilní aplikace
el: Εφαρμογή Κινητού
fi: Mobiilisovellus
hu: Mobil Alkalmazás
ro: Aplicație Mobilă
tr: Mobil Uygulama

source: Blog
fi: Blogi
ru: Блог
sv: Blogg
uk: Блог

source: Privacy Policy
cs: Zásady ochrany osobních údajů
el: Πολιτική Απορρήτου
fi: Tietosuojakäytäntö
hu: Adatvédelmi Irányelvek
ro: Politica de Confidențialitate
tr: Gizlilik Politikası

source: Terms of Service
cs: Podmínky služby
el: Όροι Υπηρεσίας
fi: Käyttöehdot
hu: Szolgáltatási Feltételek
ro: Termenii Serviciului
tr: Hizmet Şartları

source: Legal
cs: Právní
el: Νομικά
fi: Oikeudellinen
hu: Jogi
tr: Yasal

source: Cookie Policy
cs: Zásady cookies
el: Πολιτική Cookies
fi: Evästeetäytäntö
hu: Cookie Irányelvek
ro: Politica Cookie-urilor
tr: Çerez Politikası

source: All rights reserved.
cs: Všechna práva vyhrazena.
el: Όλα τα δικαιώματα διατηρούνται.
fi: Kaikki oikeudet pidätetään.
hu: Minden jog fenntartva.
ro: Toate drepturile rezervate.
tr: Tüm hakları saklıdır.

source: Apps
it: App
pl: Aplikacje
pt: Aplicações
ru: Приложения
sv: Appar
uk: Додатки
